<a href="https://colab.research.google.com/github/Enrique474747/test-repo-bueno/blob/main/Practica_Banco.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
!gdown 1puf9UBuzaVqMW3ZMMXhd626E5yVJd_QX

Downloading...
From: https://drive.google.com/uc?id=1puf9UBuzaVqMW3ZMMXhd626E5yVJd_QX
To: /content/data_berka.db
100% 70.2M/70.2M [00:00<00:00, 94.1MB/s]

1.1) Cargamos la extensión sql(nos permite ejecutar comandos sql directamente en colab)

In [5]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

1.2) Conectar a la Base de Datos

In [3]:
%sql sqlite:///data_berka.db

1.3) Comprobamos el esquema de la Base de Datos. Para ejecutar comandos sql, se debe añadir %%sql comando O EN MÚLTIPLES LÍNEAS %%sql comando_linea1 comando_linea2

In [6]:
%%sql
SELECT name, type
FROM sqlite_master
WHERE type = "table"

 * sqlite:///data_berka.db
Done.

[('DISTRICT', 'table'),
 ('ACCOUNT', 'table'),
 ('TRANS', 'table'),
 ('CLIENT', 'table'),
 ('DISPOSITION', 'table'),
 ('CREDIT_CARD', 'table'),
 ('LOAN', 'table'),
 ('PERMANENT_ORDER', 'table')]

# 2) Ejercicios

2.1) Muestre los datos de la tabla cliente

In [7]:
%sql SELECT * FROM CLIENT LIMIT 5

 * sqlite:///data_berka.db
Done.

[(1, '706213', 18),
 (2, '450204', 1),
 (3, '406009', 1),
 (4, '561201', 5),
 (5, '605703', 5)]

2.2) lISTE TODOS LOS CLIENTES CON CUENTAS ACTIVAS Y PRÉSTAMOS INCLUYENDO DINERO PRESTADO Y SALDOS DE CUENTA

In [9]:
%sql SELECT * FROM DISTRICT LIMIT 5

 * sqlite:///data_berka.db
Done.

[(1, 'Hl.m. Praha', 'Prague', 1204953, 0, 0, 0, 1, 1, 100.0, 12541, 0.29, 0.43, 167, 85677, 99107),
 (2, 'Benesov', 'central Bohemia', 88884, 80, 26, 6, 2, 5, 46.7, 8507, 1.67, 1.85, 132, 2159, 2674),
 (3, 'Beroun', 'central Bohemia', 75232, 55, 26, 4, 1, 5, 41.7, 8980, 1.95, 2.21, 111, 2824, 2813),
 (4, 'Kladno', 'central Bohemia', 149893, 63, 29, 6, 2, 6, 67.4, 9753, 4.64, 5.05, 109, 5244, 5892),
 (5, 'Kolin', 'central Bohemia', 95616, 65, 30, 4, 1, 6, 51.4, 9307, 3.85, 4.43, 118, 2616, 3040)]

In [10]:
%sql SELECT * FROM Account LIMIT 5

 * sqlite:///data_berka.db
Done.

[(576, 55, 'monthly', 930101),
 (3818, 74, 'monthly', 930101),
 (704, 55, 'monthly', 930101),
 (2378, 16, 'monthly', 930101),
 (2632, 24, 'monthly', 930102)]

In [11]:
%sql SELECT * FROM trans LIMIT 5

 * sqlite:///data_berka.db
Done.

[(695247, 2378, 930101, 'PRIJEM', 'VKLAD', 700.0, 700.0, None, None, None),
 (171812, 576, 930101, 'PRIJEM', 'VKLAD', 900.0, 900.0, None, None, None),
 (207264, 704, 930101, 'PRIJEM', 'VKLAD', 1000.0, 1000.0, None, None, None),
 (1117247, 3818, 930101, 'PRIJEM', 'VKLAD', 600.0, 600.0, None, None, None),
 (579373, 1972, 930102, 'PRIJEM', 'VKLAD', 400.0, 400.0, None, None, None)]

In [13]:
%sql SELECT * FROM disposition LIMIT 5

 * sqlite:///data_berka.db
Done.

[(1, 1, 1, 'OWNER'),
 (2, 2, 2, 'OWNER'),
 (3, 3, 2, 'DISPONENT'),
 (4, 4, 3, 'OWNER'),
 (5, 5, 3, 'DISPONENT')]

In [14]:
%sql SELECT * FROM CREDIT_CARD limit 5

 * sqlite:///data_berka.db
Done.

[(1005, 9285, 'classic', '931107 00:00:00'),
 (104, 588, 'classic', '940119 00:00:00'),
 (747, 4915, 'classic', '940205 00:00:00'),
 (70, 439, 'classic', '940208 00:00:00'),
 (577, 3687, 'classic', '940215 00:00:00')]

In [15]:
%sql SELECT* FROM LOAN LIMIT 5

 * sqlite:///data_berka.db
Done.

[(5314, 1787, 930705, 96396, 12, 8033, 'B'),
 (5316, 1801, 930711, 165960, 36, 4610, 'A'),
 (6863, 9188, 930728, 127080, 60, 2118, 'A'),
 (5325, 1843, 930803, 105804, 36, 2939, 'A'),
 (7240, 11013, 930906, 274740, 60, 4579, 'A')]

In [17]:
%sql SELECT * FROM PERMANENT_ORDER LIMIT 5

 * sqlite:///data_berka.db
Done.

[(29401, 1, 'YZ', '87144583', 2452, 'SIPO'),
 (29402, 2, 'ST', '89597016', 3372.7, 'UVER'),
 (29403, 2, 'QR', '13943797', 7266, 'SIPO'),
 (29404, 3, 'WX', '83084338', 1135, 'SIPO'),
 (29405, 3, 'CD', '24485939', 327, ' ')]

In [29]:
%%sql SELECT c.client_id as CLIENTE, ROUND(SUM(l.amount), 2) as Importe_prestado,
ROUND(SUM(CASE
    WHEN t.type = 'PRIJEM' THEN t.amount
    WHEN t.type = 'VYDAJ' THEN -t.amount
    ELSE 0
    END), 2) AS balance_cuenta
FROM CLIENT c
LEFT JOIN disposition d ON d.client_id = c.client_id
LEFT JOIN ACCOUNT a ON a.account_id = d.account_id
LEFT JOIN LOAN l ON l.account_id = a.account_id
LEFT JOIN trans t ON t.account_id = a.account_id
WHERE d.type = 'OWNER'
group by c.client_id
LIMIT 5

 * sqlite:///data_berka.db
Done.

[(1, None, 13466.5),
 (2, 38695056.0, 260069.7),
 (4, None, 51096.2),
 (6, None, 33720.6),
 (7, None, 28088.6)]

In [35]:
%%sql SELECT c.client_id as cliente, COUNT(a.account_id) AS total_cuentas
FROM CLIENT c
left JOIN disposition d ON d.client_id = c.client_id
LEFT JOIN Account a ON a.account_id = d.account_id
GROUP BY c.client_id
HAVING total_cuentas > 1

 * sqlite:///data_berka.db
Done.

[]